In [2]:
#!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\adarshkumar\anaconda3\lib\site-packages (8.0.21)
Requirement already satisfied: protobuf>=3.0.0 in c:\users\adarshkumar\anaconda3\lib\site-packages (from mysql-connector-python) (3.14.0)
Requirement already satisfied: six>=1.9 in c:\users\adarshkumar\anaconda3\lib\site-packages (from protobuf>=3.0.0->mysql-connector-python) (1.12.0)

In [3]:
import mysql.connector

In [17]:
import pandas as pd
con=mysql.connector.connect(
    host = "localhost",
    port =3306,
    user = 'root',
    password = 'root',
    database = "company_database")

#df =pd.read_sql_query('select * from employee',con)
#df.head()
#print(mydb)

In [18]:
df.head()

   client_id          client_name  branch_id
0        400   Dunmore Highschool          2
1        401    Lackawana Country          2
2        402                FedEx          3
3        403   John Daly Law, LLC          3
4        404  Scranton Whitepages          2

In [14]:
df =pd.read_sql_query('select * from client',con)
df

   client_id          client_name  branch_id
0        400   Dunmore Highschool          2
1        401    Lackawana Country          2
2        402                FedEx          3
3        403   John Daly Law, LLC          3
4        404  Scranton Whitepages          2
5        405      Times Newspaper          3
6        406                FedEx          2